; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph2 - mode
	image3 - mode
	thermograph0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star4 - direction
	Star6 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation7 - direction
	GroundStation2 - direction
	Star10 - direction
	GroundStation9 - direction
	GroundStation8 - direction
	Star5 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 image3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation7)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 GroundStation9)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation9)
)
(:goal (and
	(pointing satellite0 Phenomenon13)
	(have_image Planet11 thermograph0)
	(have_image Phenomenon12 thermograph0)
	(have_image Phenomenon13 spectrograph2)
	(have_image Planet14 thermograph0)
	(have_image Planet15 image3)
	(have_image Phenomenon16 spectrograph1)
	(have_image Phenomenon17 spectrograph1)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 8
2. (calibrate satellite2 instrument4 groundstation9)
   added: (calibrated instrument4)
   goals met: 0 of 8
3. (turn_to satellite2 phenomenon16 groundstation9)
   deleted: (pointing satellite2 groundstation9)
   added: (pointing satellite2 phenomenon16)
   goals met: 0 of 8
4. (take_image satellite2 phenomenon16 instrument4 spectrograph1)
   added: (have_image phenomenon16 spectrograph1)
   goals met: 1 of 8
5. (turn_to satellite2 phenomenon13 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon13)
   goals met: 1 of 8
6. (turn_to satellite1 groundstation1 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 8
7. (take_image satellite2 phenomenon13 instrument4 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 2 of 8
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 8
9. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 2 of 8
10. (turn_to satellite0 phenomenon13 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 8
11. (turn_to satellite1 phenomenon12 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 8
12. (take_image satellite1 phenomenon12 instrument2 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 4 of 8
13. (turn_to satellite1 planet11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet11)
   goals met: 4 of 8
14. (take_image satellite1 planet11 instrument2 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 5 of 8
15. (turn_to satellite1 planet14 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet14)
   goals met: 5 of 8
16. (take_image satellite1 planet14 instrument2 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 6 of 8
17. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 6 of 8
18. (take_image satellite1 planet15 instrument2 image3)
   added: (have_image planet15 image3)
   goals met: 7 of 8
19. (turn_to satellite2 phenomenon17 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon17)
   goals met: 7 of 8
20. (take_image satellite2 phenomenon17 instrument4 spectrograph1)
   added: (have_image phenomenon17 spectrograph1)
   goals met: 8 of 8
